Documents/LM_РасчетЗарплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>LM_РасчетЗарплаты</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Педагог</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключаяБесплатныеЗанятия</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РКО</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пермещение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.LM_ПеремещениеДенег</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопРасходы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РассчитыватьПоСтавкеПедагога</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОплатаЗаЗанятие</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОплатаСЧеловека</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОплатаЗаЧас</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентСОплатыУченика</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДД</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.LM_Урок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Часы</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Начисления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/LM_СписанияСуммЗаУроки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<AccumulationRegister>
		<Properties>
			<Name>LM_СписанияСуммЗаУроки</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Часы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.LM_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Абонемент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.LM_Абонемент</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Педагог</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.LM_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.LM_Тарифы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Скидка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.LM_Скидки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПредметОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.LM_ПредметыОбучения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.LM_ГруппыОбучения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Явка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/LM_Касса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>LM_Касса</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.LM_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.LM_ВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПредметОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.LM_ПредметыОбучения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/LM_ВидыОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>LM_ВидыОпераций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВнутренняяКасса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КассаУченики</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/LM_ПеремещениеДенег.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>LM_ПеремещениеДенег</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.LM_СписанияСуммЗаУроки</xr:Item>
				<xr:Item>AccumulationRegister.LM_Касса</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
						<v8:Type>cfg:CatalogRef.LM_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассаОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассаПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредметОбученияОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.LM_ПредметыОбучения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СделатьДвиженияПоВзаиморасчетам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредметОбученияПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.LM_ПредметыОбучения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.LM_ВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснования</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.LM_Урок</v8:Type>
						<v8:Type>cfg:DocumentRef.LM_РасчетЗарплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/РасходныйКассовыйОрдер.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>РасходныйКассовыйОрдер</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.LM_СписанияСуммЗаУроки</xr:Item>
				<xr:Item>AccumulationRegister.LM_Касса</xr:Item>
				<xr:Item>AccumulationRegister.LM_РасчетыПоЗарплате</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.LM_Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>LM_ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.LM_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.LM_ВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснования</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.LM_Урок</v8:Type>
						<v8:Type>cfg:CatalogRef.LM_Абонемент</v8:Type>
						<v8:Type>cfg:CatalogRef.LM_ФизЛица</v8:Type>
						<v8:Type>cfg:DocumentRef.LM_РасчетЗарплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредметОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.LM_ПредметыОбучения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/LM_РасчетЗарплаты/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПериодПриИзменении(Элемент)	
	
	Объект.ДатаНачала = Период.ДатаНачала;
	Объект.ДатаОкончания = Период.ДатаОкончания;
	
	Объект.ДД.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТЧ(Команда)
	Объект.ДД.Очистить();
	ЗаполнитьТЧНаСервере();
КонецПроцедуры

Процедура ЗаполнитьТЧНаСервере()
	
	Запрос = Новый Запрос;
	
	Если Объект.РассчитыватьПоСтавкеПедагога или ЗначениеЗаполнено(Объект.ОплатаСЧеловека) или ЗначениеЗаполнено(Объект.ПроцентСОплатыУченика) Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СписанияСуммЗаУрокиОбороты.ЧасыРасход КАК ЧасыРасход,
		|	СписанияСуммЗаУрокиОбороты.СуммаРасход КАК СуммаРасход,
		|	СписанияСуммЗаУрокиОбороты.Клиент КАК Клиент,
		|	СписанияСуммЗаУрокиОбороты.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрНакопления.LM_СписанияСуммЗаУроки.Обороты(&НачалоПериода, &КонецПериода, Регистратор, Педагог = &Педагог) КАК СписанияСуммЗаУрокиОбороты
		|ГДЕ
		|	СписанияСуммЗаУрокиОбороты.СуммаОборот <= 0";
	Иначе
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СписанияСуммЗаУрокиОбороты.Регистратор КАК Регистратор,
		|	СписанияСуммЗаУрокиОбороты.ЧасыРасход КАК ЧасыРасход,
		|	СписанияСуммЗаУрокиОбороты.СуммаРасход КАК СуммаРасход,
		|	СписанияСуммЗаУрокиОбороты.Регистратор.Дата КАК РегистраторДата
		|ИЗ
		|	РегистрНакопления.LM_СписанияСуммЗаУроки.Обороты(&НачалоПериода, &КонецПериода, Авто, Педагог = &Педагог) КАК СписанияСуммЗаУрокиОбороты
		|
		|УПОРЯДОЧИТЬ ПО
		|	РегистраторДата";
	КонецЕсли;

	Запрос.УстановитьПараметр("КонецПериода", Объект.ДатаОкончания);
	Запрос.УстановитьПараметр("НачалоПериода", Объект.ДатаНачала);
	Запрос.УстановитьПараметр("Педагог", Объект.Педагог);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Уроки = РезультатЗапроса.Выбрать();
	
	Пока Уроки.Следующий() Цикл		
		
		Если НЕ Объект.ВключаяБесплатныеЗанятия и НЕ ЗначениеЗаполнено(Уроки.СуммаРасход) Тогда 
			Продолжить;
		КонецЕсли;
		
		СтрокаТЧ = Объект.ДД.Добавить();
		Если ЗначениеЗаполнено(Объект.ОплатаСЧеловека) или ЗначениеЗаполнено(Объект.ПроцентСОплатыУченика)
			или (Объект.РассчитыватьПоСтавкеПедагога и ЗначениеЗаполнено(Уроки.Регистратор.СтавкаПедагога.ОплатаСЧеловека))
			или (Объект.РассчитыватьПоСтавкеПедагога и ЗначениеЗаполнено(Уроки.Регистратор.СтавкаПедагога.ПроцентСОплатыУченика)) Тогда
			СтрокаТЧ.Контрагент = Уроки.Клиент;
			СтрокаТЧ.Документ 	= Уроки.Регистратор;
		Иначе
			СтрокаТЧ.Документ 	= Уроки.Регистратор;
		КонецЕсли;
		СтрокаТЧ.Сумма 		= Уроки.СуммаРасход;
		СтрокаТЧ.Часы 		= '00010101'+Уроки.ЧасыРасход;
		
		Если Объект.РассчитыватьПоСтавкеПедагога Тогда
			
			Если ЗначениеЗаполнено(Уроки.Регистратор.СтавкаПедагога) Тогда
				Если ЗначениеЗаполнено(Уроки.Регистратор.СтавкаПедагога.ОплатаЗаЧас) Тогда
					СтрокаТЧ.Начисления = Уроки.Регистратор.СтавкаПедагога.ОплатаЗаЧас * (Уроки.ЧасыРасход/60/60);
				ИначеЕсли ЗначениеЗаполнено(Уроки.Регистратор.СтавкаПедагога.ПроцентСОплатыУченика) Тогда
					СтрокаТЧ.Начисления = Уроки.СуммаРасход * Уроки.Регистратор.СтавкаПедагога.ПроцентСОплатыУченика / 100;
				ИначеЕсли ЗначениеЗаполнено(Уроки.Регистратор.СтавкаПедагога.ОплатаЗаЗанятие) Тогда
					СтрокаТЧ.Начисления = Уроки.Регистратор.СтавкаПедагога.ОплатаЗаЗанятие;
				ИначеЕсли ЗначениеЗаполнено(Уроки.Регистратор.СтавкаПедагога.ОплатаСЧеловека) Тогда
					СтрокаТЧ.Начисления = Уроки.Регистратор.СтавкаПедагога.ОплатаСЧеловека;
				КонецЕсли;
			КонецЕсли;
			
		Иначе
			
			Если ЗначениеЗаполнено(Объект.ОплатаЗаЧас) Тогда
				СтрокаТЧ.Начисления = Объект.ОплатаЗаЧас * (Уроки.ЧасыРасход/60/60);
			ИначеЕсли ЗначениеЗаполнено(Объект.ПроцентСОплатыУченика) Тогда
				СтрокаТЧ.Начисления = Уроки.СуммаРасход * Объект.ПроцентСОплатыУченика / 100;
			ИначеЕсли ЗначениеЗаполнено(Объект.ОплатаЗаЗанятие) Тогда
				СтрокаТЧ.Начисления = Объект.ОплатаЗаЗанятие;
			ИначеЕсли ЗначениеЗаполнено(Объект.ОплатаСЧеловека) Тогда
				СтрокаТЧ.Начисления = Объект.ОплатаСЧеловека;
			КонецЕсли;
		КонецЕсли;
	
	КонецЦикла;
	
	Объект.ДопРасходы 	  	= ПолучитьДопРасходы();		
	Объект.СуммаДокумента 	= Объект.ДД.Итог("Начисления") - Объект.ДопРасходы;
	
КонецПроцедуры

Функция ПолучитьДопРасходы()
	
	Если ЗначениеЗаполнено(Объект.Касса) и ЗначениеЗаполнено(Объект.ДатаОкончания) и ЗначениеЗаполнено(Объект.ДатаНачала) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	КассаОбороты.СуммаРасход КАК СуммаРасход
		|ИЗ
		|	РегистрНакопления.LM_Касса.Обороты(&НачалоПериода, &КонецПериода, , Касса = &Касса) КАК КассаОбороты";
		Запрос.УстановитьПараметр("КонецПериода", Объект.ДатаОкончания);
		Запрос.УстановитьПараметр("НачалоПериода", Объект.ДатаНачала);
		Запрос.УстановитьПараметр("Касса", Объект.Касса);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Возврат ВыборкаДетальныеЗаписи.СуммаРасход;
		КонецЦикла;
		Возврат 0;
	Иначе
		Возврат 0;
	КонецЕсли;	
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Период.ДатаНачала = Объект.ДатаНачала;
	Период.ДатаОкончания = Объект.ДатаОкончания;
	
	ОстатокВКассе = КассаПриИзмененииНаСервере();
	
	ОбновитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ПедагогПриИзменении(Элемент) 	
	Объект.ДД.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура ДДПриИзменении(Элемент)
	Объект.СуммаДокумента 		= Объект.ДД.Итог("Начисления");
КонецПроцедуры

Функция КассаПриИзмененииНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КассаОстатки.СуммаОстаток КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.LM_Касса.Остатки(, ) КАК КассаОстатки
		|ГДЕ
		|	КассаОстатки.Касса = &Касса";  	
	Запрос.УстановитьПараметр("Касса", Объект.Касса);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.СуммаОстаток;
	КонецЦикла;
	
	Возврат 0;
	
КонецФункции

&НаКлиенте
Процедура КассаПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ДатаОкончания) Тогда
		ОстатокВКассе = КассаПриИзмененииНаСервере();
		Иначе
		ОстатокВКассе = 0;

	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьОстатокПоКассе(Команда)
	ОстатокВКассе = КассаПриИзмененииНаСервере();	
КонецПроцедуры

Функция ПереместитьДеньгиНаСервере()
	
	НовПеремещение = Документы.LM_ПеремещениеДенег.СоздатьДокумент();
	НовПеремещение.ВидОперации 			= Перечисления.LM_ВидыОпераций.ВнутренняяКасса;
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		НовПеремещение.ДокументОснования 	= Объект.Ссылка;
	КонецЕсли;

	НовПеремещение.АвторДокумента 		= Пользователи.АвторизованныйПользователь();
	НовПеремещение.КассаОтправитель		= Объект.Касса;
	НовПеремещение.КассаПолучатель		= Справочники.Кассы.ПолучитьОсновнуюКассу();
	НовПеремещение.Клиент 				= Объект.Педагог;
	НовПеремещение.Сумма 				= КассаПриИзмененииНаСервере();
	НовПеремещение.Дата					= Объект.ДатаОкончания-1;
	НовПеремещение.Организация 			= Объект.Организация;
	
	Попытка
		НовПеремещение.Записать(РежимЗаписиДокумента.Проведение);
		Возврат НовПеремещение.Ссылка;
	Исключение
		Сообщить("Не удалось провести Перемещение!"+ " " +ОписаниеОшибки());
	КонецПопытки;
	
	Возврат Документы.LM_ПеремещениеДенег.ПустаяСсылка();
	
КонецФункции

&НаКлиенте
Процедура ПереместитьДеньги(Команда)
	               	
	Если ЗначениеЗаполнено(Объект.Пермещение) Тогда
		Сообщить("Невозможно создать еще одно Перемещение! Существует уже созданное ранее.");
		Возврат;
	КонецЕсли; 	
	
	Если ЗначениеЗаполнено(Объект.СуммаДокумента) и ЗначениеЗаполнено(Объект.Касса) и ЗначениеЗаполнено(Объект.Педагог) и ЗначениеЗаполнено(Объект.ДатаОкончания) Тогда
		Объект.Пермещение = ПереместитьДеньгиНаСервере();
		//ОткрытьЗначение(Объект.Пермещение);
	Иначе
		Сообщить("Невозможно создать Перемещение! Возможно незаполнены поля: Касса, Педагог, СуммаДокумента, Период");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СуммаДокументаПриИзменении(Элемент)
	Объект.СуммаДокумента = Объект.ДД.Итог("Начисления") - Объект.ДопРасходы;
	Объект.ПроцентСОплатыУченика = 0;
КонецПроцедуры

Функция СделтьРКОНаСервере()
	
	НовРКО = Документы.РасходныйКассовыйОрдер.СоздатьДокумент();
	НовРКО.ВидОперации 			= Перечисления.LM_ВидыОпераций.ВнутренняяКасса;
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		НовРКО.ДокументОснования 	= Объект.Ссылка;
	КонецЕсли;
	НовРКО.АвторДокумента 		= Пользователи.АвторизованныйПользователь();
	НовРКО.Касса 				= Объект.Касса;
	НовРКО.Клиент 				= Объект.Педагог;
	НовРКО.Организация 			= Объект.Организация;
	НовРКО.Сумма 				= Объект.СуммаДокумента;
	НовРКО.Дата					= Объект.ДатаОкончания-1;
	
	Попытка
		НовРКО.Записать(РежимЗаписиДокумента.Проведение);
		Возврат НовРКО.Ссылка;
	Исключение
		Сообщить("Не удалось провести РКО!"+ " " +ОписаниеОшибки());
	КонецПопытки;

	Возврат Документы.РасходныйКассовыйОрдер.ПустаяСсылка();
	
КонецФункции

&НаКлиенте
Процедура СделтьРКО(Команда)
	
	Если ЗначениеЗаполнено(Объект.РКО) Тогда
		Сообщить("Невозможно создать еще один Расходный ордер! Существует уже созданный ранее.");
		Возврат;
	КонецЕсли; 	
	
	Если ЗначениеЗаполнено(Объект.СуммаДокумента) и ЗначениеЗаполнено(Объект.Касса) и ЗначениеЗаполнено(Объект.Педагог) и ЗначениеЗаполнено(Объект.ДатаОкончания) Тогда
		Объект.РКО = СделтьРКОНаСервере();
		//ОткрытьЗначение(Объект.РКО);
	Иначе
		Сообщить("РКО невозможно создать! Возможно незаполнены поля: Касса, Педагог, СуммаДокумента, Период");
	КонецЕсли;

КонецПроцедуры

Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);	
КонецПроцедуры

&НаКлиенте
Процедура ПроцентОтОплатыПриИзменении(Элемент)
	Объект.ОплатаЗаЧас	   = 0;
	Объект.ОплатаСЧеловека = 0;
	Объект.ОплатаЗаЗанятие = 0;
КонецПроцедуры

Процедура ОбновитьВидимость()
	
	Если Объект.РассчитыватьПоСтавкеПедагога Тогда
		Элементы.ПроцентСОплатыУченика.Доступность 	= Ложь;
		Элементы.ОплатаЗаЗанятие.Доступность 		= Ложь;
		Элементы.ОплатаЗаЧас.Доступность 			= Ложь;
		Элементы.ОплатаСЧеловека.Доступность 		= Ложь;
	Иначе
		Элементы.ПроцентСОплатыУченика.Доступность 	= Истина;
		Элементы.ОплатаЗаЗанятие.Доступность 		= Истина;
		Элементы.ОплатаЗаЧас.Доступность 			= Истина;
		Элементы.ОплатаСЧеловека.Доступность 		= Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтавкаПедагогаПриИзменении(Элемент)
	ОбновитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ОплатаЗаЗанятиеПриИзменении(Элемент)
	Объект.ОплатаЗаЧас			 = 0;
	Объект.ОплатаСЧеловека       = 0;
	Объект.ПроцентСОплатыУченика = 0;
КонецПроцедуры

&НаКлиенте
Процедура ОплатаСЧеловекаПриИзменении(Элемент)
	Объект.ОплатаЗаЧас			 = 0;
	Объект.ОплатаЗаЗанятие       = 0;
	Объект.ПроцентСОплатыУченика = 0;
КонецПроцедуры

&НаКлиенте
Процедура ОплатаЗаЧасПриИзменении(Элемент)
	Объект.ОплатаЗаЗанятие			 = 0;
	Объект.ОплатаСЧеловека       = 0;
	Объект.ПроцентСОплатыУченика = 0;
КонецПроцедуры
